import { useState } from 'react';
import {
  Box,
  Grid,
  GridItem,
  IconButton,
  Modal,
  ModalOverlay,
  ModalContent,
  ModalHeader,
  ModalBody,
  ModalCloseButton,
  useDisclosure,
  Select
} from '@chakra-ui/react';
import { FaCartPlus } from 'react-icons/fa';

const JobZoneComponent = () => {
  const jobZones = [
    { id: 1, title: 'منطقه شغلی یک', description: 'آمادگی کمی یا بدون نیاز است' , html: `<div>
    <h3><strong>منطقه شغلی یک: نیاز به آمادگی کم یا بدون نیاز</strong></h3>
    <p>
      <strong>تجربه</strong><br />
      برای این شغل‌ها نیازی به مهارت، دانش یا تجربه قبلی کار مرتبط نیست. به عنوان مثال، یک شخص می‌تواند حتی اگر هیچ‌گاه قبل از این کار نکرده باشد، به عنوان پیشخدمت فعالیت کند.
    </p>
    <p>
      <strong>آموزش</strong><br />
      کارکنان این شغل‌ها باید برای چند روز تا چند ماه آموزش ببینند. معمولاً یک کارگر با تجربه می‌تواند به شما نشان دهد که چگونه این کار را انجام دهید.
    </p>
    <p>
      <strong>تحصیلات</strong><br />
      برخی از این شغل‌ها ممکن است نیاز به داشتن مدرک دیپلم دبیرستان یا گواهی GED داشته باشند.
    </p>
    <p>
      <strong>مثال‌ها</strong><br />
      این شغل‌ها شامل دنبال کردن دستورالعمل‌ها و کمک به دیگران است. مثال‌هایی از این شغل‌ها شامل کارگران تهیه غذا، ظرفشویی، سنگزنی و تمام کردن کف‌ها، کارگران باغبانی و نگهداری از محوطه‌ها، اپراتورهای تجهیزات چوب‌بری، و باریستاها می‌شود.
    </p>
  </div>`},
    { id: 2, title: 'منطقه شغلی دو', description: 'مقداری آمادگی لازم است',  html: `منطقه شغلی دو: نیاز به آمادگی کم
<br>
    <strong>تجربه</strong><br>
    معمولاً برای این شغل‌ها، تجربه، مهارت یا دانشی در حوزه کار قبلی لازم است. به عنوان مثال، تجربه کار با عموم مردم برای یک صندوقدار مفید است.
    <br>
    <strong>آموزش</strong><br>
    کارکنان این شغل‌ها به مدت چند ماه تا یک سال با کارمندان ماهر همکاری می‌کنند. برنامه کارآموزی برای این شغل‌ها ممکن است موجود باشد.
    <br>
    <strong>تحصیلات</strong><br>
    این شغل‌ها معمولاً نیاز به داشتن مدرک دیپلم دبیرستانی دارند.
    <br>
    <strong>مثال‌ها</strong><br>
    این شغل‌ها معمولاً شامل استفاده از دانش و مهارت‌های خود برای کمک به دیگران هستند. مثال‌هایی از این شغل‌ها شامل پرستاران عمومی، کارمندان فروشگاه، نمایندگان خدمات مشتریان، نگهبانان امنیتی، کاشی‌کاران، صندوقداران و تکنسین‌های آزمایشگاه دندانپزشکی می‌شود.`},
    { id: 3, title: 'منطقه شغلی سه', description: 'آمادگی متوسط مورد نیاز است', html: `<h2>منطقه شغلی سه: نیاز به آمادگی متوسط</h2>
    <br>
    <strong>تجربه</strong><br>
    برای این شغل‌ها نیاز به مهارت، دانش یا تجربه قبلی کار مرتبط وجود دارد. به عنوان مثال، برای یک الکتریسین نیاز است تا به مدت سه تا چهار سال در یک برنامه کارآموزی شرکت کند یا چند سال تجربه کاری داشته باشد. ممکن است برای انجام این کار نیاز به قبولی در آزمون جهت دریافت مجوز وجود داشته باشد.
    <br>
    <strong>آموزش</strong><br>
    کارکنان این شغل‌ها به مدت یک تا دو سال آموزش نیاز دارند. هم تجربه کاری در محل کار و هم آموزش غیررسمی با کارگران با تجربه ممکن است لازم باشد. برنامه کارآموزی می‌تواند یک گزینه مناسب برای این شغل‌ها باشد.
    <br>
    <strong>تحصیلات</strong><br>
    بیشتر این شغل‌ها نیاز به آموزش در مدرسه حرفه‌ای، تجربه کاری در محل کار یا مدرک کارشناسی دارند.
    <br>
    <strong>مثال‌ها</strong><br>
    این شغل‌ها معمولاً شامل استفاده از مهارت‌های ارتباطی و سازمانی برای هماهنگی، نظارت، مدیریت یا آموزش دیگران به منظور دستیابی به اهداف هستند. مثال‌هایی از این شغل‌ها شامل مدیران تولید هیدروالکتریک، انتشاردهندگان دسکتاپ، الکتریسین‌ها، تکنسین‌های کشاورزی، آرایشگران، گزارشگران دادگاه و عنوان‌گذاران همزمان و دستیاران پزشکی می‌شود.`},
    { id: 4, title: 'منطقه شغلی چهار', description: 'آمادگی بالا مورد نیاز است', html: `<h2>منطقه شغلی چهار: نیاز به آمادگی بالا</h2>
    <br>
    <strong>تجربه</strong><br>
    برای این شغل‌ها نیاز به مهارت، دانش یا تجربه بلند مدت در حوزه کار مربوطه وجود دارد. به عنوان مثال، برای یک حسابدار نیاز است تا چهار سال تحصیل در دانشگاه را تکمیل کرده و چند سال در زمینه کاری فعالیت داشته باشد تا واجد شرایط شغلی باشد.
    <br>
    <strong>آموزش</strong><br>
    کارکنان این شغل‌ها نیاز به چند سال تجربه کاری و آموزش مرتبط دارند. هم آموزش در محل کار و هم آموزش در کلاس ممکن است لازم باشد.
    <br>
    <strong>تحصیلات</strong><br>
    بیشتر این شغل‌ها نیاز به مدرک کارشناسی چهار ساله دارند، اما برخی از آن‌ها نیازی به این مدرک ندارند.
    <br>
    <strong>مثال‌ها</strong><br>
    بسیاری از این شغل‌ها شامل هماهنگی، نظارت، مدیریت یا آموزش دیگران هستند. مثال‌هایی از این شغل‌ها شامل کارشناسان املاک، مدیران فروش، مدیران پایگاه داده، طراحان گرافیک، دانشمندان حفاظت محیط زیست، مدیران هنری و برآوردگران هزینه می‌شود.`},
    { id: 5, title: 'منطقه شغلی پنجم', description: 'آماده سازی گسترده مورد نیاز است', html:  `<h2>منطقه شغلی پنج: نیاز به آمادگی گسترده</h2>
    <br>
    <strong>تجربه</strong><br>
    برای این شغل‌ها نیاز به مهارت، دانش و تجربه گسترده وجود دارد. بسیاری از آن‌ها نیاز به بیش از پنج سال تجربه دارند. به عنوان مثال، جراحان باید چهار سال تحصیل در دانشگاه و پنج تا هفت سال تمرکز آموزش پزشکی تخصصی را تکمیل کنند تا بتوانند وظیفه خود را انجام دهند.
    <br>
    <strong>آموزش</strong><br>
    کارکنان ممکن است نیاز به آموزش در محل کار داشته باشند. با این حال، شخص معمولاً قبل از شروع کار به مهارت‌ها، دانش، تجربه کاری و آموزش مورد نیاز برخوردار خواهد بود.
    <br>
    <strong>تحصیلات</strong><br>
    بیشتر این شغل‌ها نیاز به تحصیلات در دانشکده‌ی فارغ‌التحصیلی دارند. به عنوان مثال، آن‌ها ممکن است نیاز به مدرک کارشناسی ارشد داشته باشند و برخی از آن‌ها نیاز به مدرک دکترا (Ph.D.)، دکترای پزشکی (M.D.) یا مدرک حقوق (J.D.) باشند.
    <br>
    <strong>مثال‌ها</strong><br>
    این شغل‌ها معمولاً شامل هماهنگی، آموزش، نظارت یا مدیریت فعالیت‌های دیگران برای دستیابی به اهداف هستند. مهارت‌های بسیار پیشرفته ارتباطی و سازمانی مورد نیاز است. مثال‌هایی از این شغل‌ها شامل داروسازان، وکلای حقوق، استرودانشمندان، زیست‌شناسان، کشیشان، دستیاران پزشک و دامپزشکان می‌شود.`},
  ];

  const { isOpen, onOpen, onClose } = useDisclosure();
  const [selectedZone, setSelectedZone] = useState(null);

  

  const handleCardClick = (zone) => {
    setSelectedZone(zone);
    onOpen();
  };

  const renderJobZoneCards = () => {
    return jobZones.map((zone) => (
      <GridItem key={zone.id} p={4}>
        <Box
          bg="white"
          p={4}
          boxShadow="md"
          borderRadius="md"
          transition="transform 0.3s ease"
          _hover={{ transform: 'scale(1.05)' }}
          cursor="pointer"
          onClick={() => handleCardClick(zone)}
        >
          {/* <IconButton
            icon={<FaCartPlus />}
            colorScheme="teal"
            aria-label="Job Zone Icon"
            fontSize="2xl"
            mb={2}
          /> */}
          <Box fontWeight="bold">{zone.title}: {zone.description}</Box>
        </Box>
      </GridItem>
    ));
  };

  return (
    <>
      <Grid templateColumns="repeat(5, 1fr)" gap={1} p={2}>
        {renderJobZoneCards()}
      </Grid>

      <Modal isOpen={isOpen} onClose={onClose}>
        <ModalOverlay />
        <ModalContent>
          <ModalHeader></ModalHeader>
          <ModalCloseButton />
          <ModalBody>
            <div dangerouslySetInnerHTML={{ __html: selectedZone?.html }} />
          </ModalBody>
        </ModalContent>
      </Modal>
    </>
  );
};

export default JobZoneComponent;